//----------------------------------------------------------------------------------------------
// c언어 기말 과제 201915622 김민석  
//----------------------------------------------------------------------------------------------
#include <stdio.h>
#include <memory.h>
#include <stdlib.h>
#include <string.h>

#define MAX_NLEN    20 //최대 이름 길이
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
typedef struct Member{//개인정보 구조체 정의
    int num; //번호
    char name[MAX_NLEN+1];//이름
    int tell; //전화번호  
    char email[100]; //이메일 
    struct Member *next;
    struct Member *prev;
 }Member;
  
Member *head, *tail;
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void FindName();	//이름으로 찾기 
void FindTell();	//전화번호로 찾기 
void Initialize();	
void Run();
void Exit();
int SelectMenu();//메뉴 출력 및 선택 
int main(void)
{
    Initialize();//초기화
    Run();
    Exit();//종료하기 전에 할당한 메모리 해제
    return 0;
}
void ViewMemData(Member *mem);
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
int file()
{
	FILE *fp = fopen("Memberlist.txt", "w+");
	char out_str = { 0, };
	char in_str = { 0, };
	
	if(fp == NULL)
	{
		fprintf(stdout, "등록된 정보가 없습니다.");
		exit(1);
	}
	
	fprintf(stdout, "문장 입력:");
	fscanf(stdin, "%[^\n]s", out_str);
	fprintf(fp, "%s", out_str);
	rewind(fp);
	fscanf(fp, "%[^\n]s", in_str);
	fprintf(stdout, "저장된 문장: %s\n", in_str);
	
	fclose(fp);
	return 0;
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
int SelectMenu()		//0. 초기화면  
{    
    int key=0;
    printf("개인정보 관리 프로그램\n");
    printf("1: 개인정보 입력 \n2: 개인정보 삭제 \n3: 개인정보 검색 \n4: 목록 보기 \n0: 종료 \n");
    scanf("%d",&key);
    return key;
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void AddMember()		//1. 개인정보 입력  
{
    int num=0;
    Member *mem=0;
    Member *seek=0;
    int s=0;
	char name=0;//이름
    int tell=0; //전화번호
    char email=0; //이메일
     
    printf("추가할 개인정보 번호: ");
    scanf("%d",&num);
      
    mem = (Member *)malloc(sizeof(Member));//개인정보 구조체 동적 메모리 할당    
    mem->num = num;
    printf("성명: ");
    scanf("%s",mem->name,sizeof(mem->name));
    printf("전화번호: "); 
    scanf("%d",&tell);
    mem->tell = tell;
    printf("이메일: ");
    scanf("%s",mem->email,sizeof(mem->email));
    
    
    
    //중복데이터 확인
    for(seek=head->next; seek != tail; seek =seek->next) //1번부터 끝까지 리스트 스캔 
    {
    //printf("%10s중복확인?: \n",seek->num);
    //printf("%10s찾을이름?: \n",mem->num);
        if(seek->num == mem->num)
        {
            printf("중복된 번호입니다.\n");
            return;
        }
    }
     
    //새로 생성한 노드를 tail 앞에 매달기
    mem->next = tail;
    mem->prev = tail->prev;
    tail->prev->next = mem;
    tail->prev = mem;
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void RemoveMember()		//2. 개인정보 삭제  
{
    int num;
    Member *seek;
    printf("삭제할 개인정보 번호: ");
    scanf("%d",&num);
  
    for(seek=head->next; seek != tail; seek =seek->next)
    {
        if(seek->num == num)
        {
            //연결리스트에서 링크 조절
    		seek->prev->next = seek->next;
            seek->next->prev = seek->prev;
            free(seek);//메모리 해제
            printf("삭제하였습니다.\n");
            return;
        }
    }
    printf("데이터가 없습니다.\n");
     
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
int SearchMenu()					//3. 개인정보 검색  
{    
    int key=0;
    printf("1: 이름으로 검색 \n2: 전화번호로 검색 \n0: 뒤로가기\n");
    scanf("%d",&key);
    return key;
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void Search()						//3.0 개인정보 검색 없을시   
{
    int key = 0;
    while((key = SearchMenu())!=(0))//선택한 메뉴가 0이 아니면 반복
    {
        switch(key)//선택한 키에 따라 기능 수행
    	{
        	case 1: FindName(); break;
        	case 2: FindTell(); break;
       		default: printf("잘못 선택하였습니다.\n"); break;
        }        
    }
    printf("검색 종료\n");
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void FindName()					//3.1 이름으로 검색  
{
	//이름검색 
	
    char name[MAX_NLEN+1],r;
	//char name=0;//이름
    Member *seek=0;
	 
	printf("검색할 이름: ");
    scanf("%s",&name);
    for(seek=head->next; seek != tail; seek =seek->next)
    {
        if(seek->name == name)
        {
            ViewMemData(seek);
            return;
        }
    }
    printf("데이터가 없습니다.\n"); 
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void FindTell()					//3.2 전화번호로 검색 
{
	//이름검색 
    int tell=0;    
    Member *seek=0;
	printf("검색할 전화번호: ");
    scanf("%d",&tell);
    for(seek=head->next; seek != tail; seek =seek->next)
    {
        if(seek->tell == tell)
        {
            ViewMemData(seek);
            return;
        }
    }
    printf("데이터가 없습니다.\n"); 
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void ViewMemData(Member *mem)		//개인정보 보기  
{
    int i = 0;        
    int s = 0;

    printf("%15d %10s %20d %20s \n",mem->num,mem->name,mem->tell,mem->email);
    
    printf("\n");
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void ListMember()					//4 목록보기  
{         
    int s = 0;
    Member *seek=0;

    printf("%15s %10s %20s %20s \n","번호","이름","전화번호","이메일");
    
    for(seek=head->next; seek != tail; seek =seek->next) //첫번째 노드부터 끝까지 스캔 
    {
        ViewMemData(seek);
    }
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void Initialize()
{
    head = (Member *)malloc(sizeof(Member));//더미 노드 생성
    tail = (Member *)malloc(sizeof(Member));//더미 노드 생성
    head->next = tail;//맨 앞 더미노드 next를 tail로 설정
    tail->prev = head;//맨 뒤 더미노드 prev를 head로 설정
    head->prev = tail->next = NULL;
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void Run()
{
    int key = 0;
    while((key = SelectMenu())!=0)//선택한 메뉴가 0이 아니면 반복
    {
        switch(key)//선택한 키에 따라 기능 수행
    	{
        	case 1: AddMember(); break;
        	case 2: RemoveMember(); break;
        	case 3: Search(); break;
        	case 4: ListMember(); break;
       		default: printf("잘못 선택하였습니다.\n"); break;
        }        
    }
    printf("프로그램 종료\n");
    /* 
    
    프로그램 종료와 함께 자동저장될수있도록 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    
	*/
}
//----------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------
void Exit()
 {    
    Member *seek=head;

    while(seek->next)
    {
		seek = seek->next;
        free(seek->prev);
    }
    free(seek);
}


